vinh107108/amazon-freertos/vendors/renesas/boards/rx65n-rsk/ports/ota_pal_for_aws/ota_pal.c
#define BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH               0x200
#define BOOT_LOADER_USER_FIRMWARE_DESCRIPTOR_LENGTH           0x100

#define LIFECYCLE_STATE_BLANK                                 ( 0xff )
#define LIFECYCLE_STATE_TESTING                               ( 0xfe )
#define LIFECYCLE_STATE_INSTALLING                            ( 0xfc )
#define LIFECYCLE_STATE_VALID                                 ( 0xf8 )
#define LIFECYCLE_STATE_INVALID                               ( 0xf0 )

#define R_OTA_ERR_NONE                                        ( 0 )
#define R_OTA_ERR_INVALID_CONTEXT                             ( -1 )
#define R_OTA_ERR_QUEUE_SEND_FAIL                             ( -2 )

#define OTA_FLASHING_IN_PROGRESS                              ( 0 )
#define OTA_FLASHING_COMPLETE                                 ( 1 )

#define OTA_SIGUNATURE_SEQUENCE_TOP_VALUE                     ( 0x30 )
#define OTA_SIGUNATURE_INTEGER_VALUE                          ( 0x02 )
#define OTA_SIGUNATURE_NOT_INCLUDE_NEGATIVE_NUMBER_VALUE      ( 0x20 )
#define OTA_SIGUNATURE_INCLUDE_NEGATIVE_NUMBER_VALUE          ( 0x21 )
#define OTA_SIGUNATURE_DATA_HALF_LENGTH                       ( 32 )
#define OTA_SIGUNATURE_SEQUENCE_INFO_LENGTH                   ( 2 )
#define OTA_SIGUNATURE_SKIP                                   ( 2 )

#define OTA_FLASH_MIN_PGM_SIZE_MASK                           ( 0xFFFFFFFF - FLASH_CF_MIN_PGM_SIZE + 1 )

typedef struct _load_firmware_control_block
{
    uint32_t status;
    uint32_t processed_byte;
    uint32_t total_image_length;
    OtaImageState_t eSavedAgentState;
    OtaFileContext_t * OtaFileContext;
} LOAD_FIRMWARE_CONTROL_BLOCK;

typedef struct _flash_block
{
    uint32_t offset;
    uint8_t * binary;
    uint32_t length;
} FLASH_BLOCK;

typedef struct _fragmented_flash_block_list
{
    FLASH_BLOCK content;
    struct _fragmented_flash_block_list * next;
} FRAGMENTED_FLASH_BLOCK_LIST;

typedef struct _packet_block_for_queue
{
    uint32_t ulOffset;
    uint32_t length;
    uint8_t * p_packet;
} PACKET_BLOCK_FOR_QUEUE;

typedef struct _firmware_update_control_block
{
    uint8_t magic_code[ 7 ];
    uint8_t image_flag;
    uint8_t signature_type[ 32 ];
    uint32_t signature_size;
    uint8_t signature[ 256 ];
    uint32_t dataflash_flag;
    uint32_t dataflash_start_address;
    uint32_t dataflash_end_address;
    uint8_t reserved1[ 200 ];
    uint32_t sequence_number;
    uint32_t start_address;
    uint32_t end_address;
    uint32_t execution_address;
    uint32_t hardware_id;
    uint8_t reserved2[ 236 ];
} FIRMWARE_UPDATE_CONTROL_BLOCK;

static int32_t ota_context_validate( OtaFileContext_t * pFileContext );
static int32_t ota_context_update_user_firmware_header( OtaFileContext_t * pFileContext );
static void ota_context_close( OtaFileContext_t * pFileContext );
static void ota_flashing_task( void * pvParameters );
static void ota_flashing_callback( void * event );
static void ota_header_flashing_callback( void * event );
static CK_RV prvGetCertificateHandle( CK_FUNCTION_LIST_PTR pxFunctionList,
                                      CK_SESSION_HANDLE xSession,
                                      const char * pcLabelName,
                                      CK_OBJECT_HANDLE_PTR pxCertHandle );
static CK_RV prvGetCertificate( const char * pcLabelName,
                                uint8_t ** ppucData,
                                uint32_t * pulDataSize );

static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_insert( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                         uint32_t offset,
                                                                         uint8_t * binary,
                                                                         uint32_t length );
static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_delete( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                         uint32_t offset );
static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_print( FRAGMENTED_FLASH_BLOCK_LIST * head );
static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_assemble( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                           FLASH_BLOCK * flash_block );

static QueueHandle_t xQueue;
static TaskHandle_t xTask;
static xSemaphoreHandle xSemaphoreFlashig;
static xSemaphoreHandle xSemaphoreWriteBlock;
static volatile LOAD_FIRMWARE_CONTROL_BLOCK load_firmware_control_block;
static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list;
static PACKET_BLOCK_FOR_QUEUE packet_block_for_queue1;
static PACKET_BLOCK_FOR_QUEUE packet_block_for_queue2;
static FIRMWARE_UPDATE_CONTROL_BLOCK * firmware_update_control_block_bank0 = ( FIRMWARE_UPDATE_CONTROL_BLOCK * ) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS;
static volatile uint32_t gs_header_flashing_task;
extern xSemaphoreHandle xSemaphoreFlashAccess;
/*-----------------------------------------------------------*/

OtaPalStatus_t otaPal_CreateFileForRx( OtaFileContext_t * const pFileContext )
{
    LogDebug( ( "otaPal_CreateFileForRx is called." ) );
    LogDebug( ( "Compiled in [%s] [%s].", __DATE__, __TIME__ ) );
    OtaPalMainStatus_t eResult = OtaPalUninitialized;
    flash_interrupt_config_t cb_func_info;

    if( pFileContext != NULL )
    {
        if( pFileContext->pFilePath != NULL )
        {
            /* create task/queue/semaphore for flashing */
            xQueue = xQueueCreate( otaconfigMAX_NUM_BLOCKS_REQUEST, sizeof( PACKET_BLOCK_FOR_QUEUE ) );
            xTaskCreate( ota_flashing_task, "OTA_FLASHING_TASK", configMINIMAL_STACK_SIZE, NULL, configMAX_PRIORITIES, &xTask );
            xSemaphoreFlashig = xSemaphoreCreateBinary();
            xSemaphoreGive( xSemaphoreFlashig );
            xSemaphoreWriteBlock = xSemaphoreCreateMutex();
            xSemaphoreGive( xSemaphoreWriteBlock );
            fragmented_flash_block_list = NULL;

            xSemaphoreTake(xSemaphoreFlashAccess, portMAX_DELAY);


