vinh107108/amazon-freertos/vendors/renesas/boards/rx65n-rsk/ports/ota_pal_for_aws/ota_pal.c
        if( xResult == CKR_OK )
        {
            pucCert = pvPortMalloc( xTemplate.ulValueLen );
        }

        if( ( xResult == CKR_OK ) && ( pucCert == NULL ) )
        {
            xResult = CKR_HOST_MEMORY;
        }

        if( xResult == CKR_OK )
        {
            xTemplate.pValue = pucCert;
            xResult = xFunctionList->C_GetAttributeValue( xSession, xHandle, &xTemplate, xCount );

            if( xResult == CKR_OK )
            {
                *ppucData = pucCert;
                *pulDataSize = xTemplate.ulValueLen;
            }
            else
            {
                vPortFree( pucCert );
            }
        }
    }
    else /* Certificate was not found. */
    {
        *ppucData = NULL;
        *pulDataSize = 0;
    }

    if( xSessionOpen == CK_TRUE )
    {
        ( void ) xFunctionList->C_CloseSession( xSession );
    }

    return xResult;
}

static int32_t ota_context_validate( OtaFileContext_t * pFileContext )
{
    return( NULL != pFileContext );
}

static int32_t ota_context_update_user_firmware_header( OtaFileContext_t * pFileContext )
{
    int32_t ret = R_OTA_ERR_INVALID_CONTEXT;
    uint8_t block[ BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH ];
    FIRMWARE_UPDATE_CONTROL_BLOCK * p_block_header;
    uint32_t length;
    flash_err_t flash_err;
    flash_interrupt_config_t cb_func_info;
    uint8_t * source_pointer, * destination_pointer;
    uint8_t data_length = 0;

    memcpy( block, ( const void * ) firmware_update_control_block_bank0, BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH );
    p_block_header = ( FIRMWARE_UPDATE_CONTROL_BLOCK * ) block;

    /* Update image flag. */
    p_block_header->image_flag = LIFECYCLE_STATE_TESTING;

    /* Update signature type. */
    memcpy( p_block_header->signature_type, OTA_JsonFileSignatureKey, sizeof( OTA_JsonFileSignatureKey ) );

    /* Parse the signature and extract ECDSA-SHA256 signature data. */
    source_pointer = pFileContext->pSignature->data;
    destination_pointer = p_block_header->signature;
    data_length = *( source_pointer + 1 ) + OTA_SIGUNATURE_SEQUENCE_INFO_LENGTH;
    memset( destination_pointer, 0, sizeof( destination_pointer ) );

    xSemaphoreTake(xSemaphoreFlashAccess, portMAX_DELAY);

    if( OTA_SIGUNATURE_SEQUENCE_TOP_VALUE == *source_pointer )
    {
        source_pointer += OTA_SIGUNATURE_SEQUENCE_INFO_LENGTH;

        while( 1 )
        {
            if( OTA_SIGUNATURE_INTEGER_VALUE == *source_pointer )
            {
                source_pointer++;

                if( OTA_SIGUNATURE_INCLUDE_NEGATIVE_NUMBER_VALUE == *source_pointer )
                {
                    source_pointer += OTA_SIGUNATURE_SKIP;
                }
                else
                {
                    source_pointer++;
                }

                memcpy( destination_pointer, source_pointer, OTA_SIGUNATURE_DATA_HALF_LENGTH );
                source_pointer += OTA_SIGUNATURE_DATA_HALF_LENGTH;
                destination_pointer += OTA_SIGUNATURE_DATA_HALF_LENGTH;

                if( ( source_pointer - pFileContext->pSignature->data ) == data_length )
                {
                    ret = R_OTA_ERR_NONE;
                    break;
                }
            }
            else
            {
                /* parsing error */
                break;
            }
        }
    }

    if( R_OTA_ERR_NONE == ret )
    {
        cb_func_info.pcallback = ota_header_flashing_callback;
        cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
        R_FLASH_Control( FLASH_CMD_SET_BGO_CALLBACK, ( void * ) &cb_func_info );
        gs_header_flashing_task = OTA_FLASHING_IN_PROGRESS;
        length = BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH;
        flash_err = R_FLASH_Write( ( uint32_t ) block, ( uint32_t ) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, length );

        if( flash_err != FLASH_SUCCESS )
        {
            nop();
        }

        while( OTA_FLASHING_IN_PROGRESS == gs_header_flashing_task )
        {
        }
    }
    xSemaphoreGive(xSemaphoreFlashAccess);
    return ret;
}

static void ota_context_close( OtaFileContext_t * pFileContext )
{
    if( NULL != pFileContext )
    {
        pFileContext->pFile = NULL;
    }
}

static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_insert( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                         uint32_t offset,
                                                                         uint8_t * binary,
                                                                         uint32_t length )
{
    FRAGMENTED_FLASH_BLOCK_LIST * tmp, * current, * previous, * new;

    new = pvPortMalloc( sizeof( FLASH_BLOCK ) );
    new->content.binary = pvPortMalloc( length );

    if( ( new != NULL ) && ( new->content.binary != NULL ) )
    {
        memcpy( new->content.binary, binary, length );
        new->content.offset = offset;
        new->content.length = length;
        new->next = NULL;

        /* new head would be returned when head would be specified as NULL. */
        if( head == NULL )
        {
            tmp = new;
        }
        else
        {
            /* search the list to insert new node */
            current = head;

            while( 1 )
            {
                if( ( new->content.offset < current->content.offset ) || ( current == NULL ) )
                {
                    break;
                }

                previous = current;
                current = current->next;
            }

            /* insert the searched node when current != head */
            if( current != head )
            {
                previous->next = new;
                new->next = current;
                tmp = head;
            }
            else
            {
                new->next = current;
                tmp = new;
            }
        }
    }
    else
    {
        tmp = NULL;
    }

    return tmp;
}

static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_delete( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                         uint32_t offset )
{
    FRAGMENTED_FLASH_BLOCK_LIST * tmp = head, * previous = NULL;

    if( head != NULL )
    {
        while( 1 )
        {
            if( tmp->content.offset == offset )
            {
                break;
            }

            if( tmp->next == NULL )
            {
                tmp = NULL;
                break;
            }

            previous = tmp;
            tmp = tmp->next;
        }

        if( tmp != NULL )
        {
            /* delete target exists on not head, remove specified and return head in this case */
            if( previous != NULL )
            {
                previous->next = tmp->next;
                vPortFree( tmp->content.binary );
                vPortFree( tmp );
                tmp = head;
            }
            else
            {
                /* delete target exists on head with subsequent data, remove head and return specified (as new head) in this case */
                if( head->next != NULL )
                {
                    tmp = head->next;
                }
                /* delete target exists on head without subsequent data, remove head and return NULL in this case */
                else
                {
                    tmp = NULL;
                }

                vPortFree( head->content.binary );
                vPortFree( head );
            }
        }
    }

    return tmp;
}

